## Terraform Plan

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_access_file.yandex_storage_object.storage_object will be created
  + resource "yandex_storage_object" "storage_object" {
      + acl          = "private"
      + bucket       = "diplom-bucket"
      + content      = (sensitive value)
      + content_type = (sensitive value)
      + id           = (known after apply)
      + key          = (sensitive value)
    }

  # module.backend_conf_file.yandex_storage_object.storage_object will be created
  + resource "yandex_storage_object" "storage_object" {
      + acl          = "private"
      + bucket       = "diplom-bucket"
      + content      = (sensitive value)
      + content_type = "application/octet-stream"
      + id           = (known after apply)
      + key          = "tf/generated_backend.tf"
    }

  # module.bucket.yandex_storage_bucket.bucket will be created
  + resource "yandex_storage_bucket" "bucket" {
      + acl                   = (known after apply)
      + bucket                = "diplom-bucket"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = "STANDARD"
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + max_size              = 1073741824
      + policy                = (known after apply)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags {
          + config_read = false
          + list        = false
          + read        = false
        }

      + grant (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.dynamodb_table.aws_dynamodb_table.dynamodb_table will be created
  + resource "aws_dynamodb_table" "dynamodb_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "infra/tf-state-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sa.yandex_iam_service_account.service_account will be created
  + resource "yandex_iam_service_account" "service_account" {
      + created_at         = (known after apply)
      + description        = (known after apply)
      + folder_id          = (known after apply)
      + id                 = (known after apply)
      + labels             = (known after apply)
      + name               = (sensitive value)
      + service_account_id = (known after apply)
    }

  # module.sa_key.yandex_iam_service_account_key.sa_key will be created
  + resource "yandex_iam_service_account_key" "sa_key" {
      + created_at                   = (known after apply)
      + encrypted_private_key        = (known after apply)
      + format                       = "PEM_FILE"
      + id                           = (known after apply)
      + key_algorithm                = "RSA_2048"
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + private_key                  = (sensitive value)
      + public_key                   = (known after apply)
      + service_account_id           = (known after apply)
    }

  # module.sa_key_file.yandex_storage_object.storage_object will be created
  + resource "yandex_storage_object" "storage_object" {
      + acl          = "private"
      + bucket       = "diplom-bucket"
      + content      = (sensitive value)
      + content_type = (sensitive value)
      + id           = (known after apply)
      + key          = (sensitive value)
    }

  # module.sa_roles[0].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_roles[1].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_roles[2].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_roles[3].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_roles[4].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_roles[5].yandex_resourcemanager_folder_iam_member.folder_iam_member will be created
  + resource "yandex_resourcemanager_folder_iam_member" "folder_iam_member" {
      + folder_id = "b1guiij21l7nnmc6dleo"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = (sensitive value)
    }

  # module.sa_static_access_key.yandex_iam_service_account_static_access_key.sa_static_access_key will be created
  + resource "yandex_iam_service_account_static_access_key" "sa_static_access_key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)
    }

  # module.symmetric_key.yandex_kms_symmetric_key.symmetric_key will be created
  + resource "yandex_kms_symmetric_key" "symmetric_key" {
      + created_at          = (known after apply)
      + default_algorithm   = "AES_256"
      + deletion_protection = true
      + description         = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = "diplom-simmetric-key"
      + rotated_at          = (known after apply)
      + rotation_period     = "2160h"
      + status              = (known after apply)
      + symmetric_key_id    = (known after apply)
    }

  # module.variables_file.yandex_storage_object.storage_object will be created
  + resource "yandex_storage_object" "storage_object" {
      + acl          = "private"
      + bucket       = "diplom-bucket"
      + content      = (sensitive value)
      + content_type = "application/octet-stream"
      + id           = (known after apply)
      + key          = "tf/generated.auto.tfvars"
    }

  # module.ydb_serverless.yandex_ydb_database_serverless.ydb_db_serverless will be created
  + resource "yandex_ydb_database_serverless" "ydb_db_serverless" {
      + created_at            = (known after apply)
      + database_path         = (known after apply)
      + deletion_protection   = true
      + document_api_endpoint = (known after apply)
      + folder_id             = (known after apply)
      + id                    = (known after apply)
      + location_id           = (known after apply)
      + name                  = "diplom-ydb"
      + sleep_after           = 0
      + status                = (known after apply)
      + tls_enabled           = (known after apply)
      + ydb_api_endpoint      = (known after apply)
      + ydb_full_endpoint     = (known after apply)

      + serverless_database {
          + enable_throttling_rcu_limit = true
          + provisioned_rcu_limit       = (known after apply)
          + storage_size_limit          = 1
          + throttling_rcu_limit        = 10
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

</details>